#+title: Práctica 0 (repaso de Ocaml)

***  agregar
#+begin_src ocaml
val agregar : 'a -> 'a conjunto -> 'a conjunto = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let rec agregar x c =
    if pertenece x c then c else match c with
    Conjunto l -> (Conjunto (x::l));;

#+end_src

#+begin_src ocaml
agrega 1 c1;;
#+end_src

#+RESULTS:
: Conjunto [1; 2; 3; 4; 5]

#+begin_src ocaml
agrega 9 c1;;
#+end_src

#+RESULTS:
: Conjunto [9; 1; 2; 3; 4; 5]

*** conjunto_of_list
#+begin_src ocaml
val conjunto_of_list : 'a list -> 'a conjunto = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let conjunto_of_list l =
    let rec aux (Conjunto l2) = function
        [] -> (Conjunto l2)
      | h::t -> aux (agregar h (Conjunto l2)) t
    in aux (Conjunto []) l;;

#+end_src

#+begin_src ocaml
conjunto_of_list [1;3;2;4;5;1;2;3;9];;
#+end_src

#+RESULTS:
: Conjunto [9; 5; 4; 2; 3; 1]

*** suprimir
#+begin_src ocaml
val suprimir : 'a -> 'a conjunto -> 'a conjunto = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let suprimir x (Conjunto l) =
    let rec aux x = function
        [] -> [] 
      | h::t -> if h=x then t else h::(aux x t)
    in Conjunto (aux x l);;

#+end_src

#+begin_src ocaml
suprimir 3 c1;;
#+end_src

#+RESULTS:
: Conjunto [1; 2; 4; 5]

*** cardinal
#+begin_src ocaml
val cardinal : 'a conjunto -> int = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let cardinal (Conjunto l) =
    let rec aux count = function
        [] -> count 
      | _::t -> aux (count+1) t
    in aux 0 l;;

#+end_src

#+begin_src ocaml
cardinal c1;;
#+end_src

#+RESULTS:
: 5

*** union
#+begin_src ocaml
val union : 'a conjunto -> 'a conjunto -> 'a conjunto = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let union c1 (Conjunto l2) =
    let rec aux (Conjunto l1) = function
        [] -> l1 
      | h::t -> if pertenece h c1 then (aux c1 t) else h::(aux (Conjunto l1) t)
    in Conjunto (aux c1 l2);;

#+end_src

#+begin_src ocaml
union c1 c2;;
#+end_src

#+RESULTS:
: Conjunto [6; 7; 8; 1; 2; 3; 4; 5]

*** interseccion
#+begin_src ocaml
val interseccion : 'a conjunto -> 'a conjunto -> 'a conjunto = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let interseccion c1 (Conjunto l2) =
    let rec aux (Conjunto l1) = function
        [] -> [] 
      | h::t -> if pertenece h c1 then h::(aux c1 t) else (aux (Conjunto l1) t)
    in Conjunto (aux c1 l2);;

#+end_src

#+begin_src ocaml
interseccion c1 c2;;
#+end_src

#+RESULTS:
: Conjunto [4; 5]

*** diferencia
#+begin_src ocaml
val diferencia : int conjunto -> int conjunto -> int conjunto = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let diferencia (Conjunto l1) c2 =
    let rec aux (Conjunto l2) = function
        [] -> [] 
      | h::t -> if pertenece h c2 then (aux c1 t) else h::(aux (Conjunto l1) t)
    in Conjunto (aux c2 l1);;

#+end_src

#+begin_src ocaml
diferencia c1 c2;;
#+end_src

#+RESULTS:
: Conjunto [1; 2; 3]

*** producto_cartesiano
#+begin_src ocaml
val producto_cartesiano : 'a conjunto -> 'b conjunto -> ('a * 'b) conjunto = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let producto_cartesiano (Conjunto l1) (Conjunto l2)=
    let rec aux l1 l2 laux = match l1,l2 with
        [],_ -> []
      | (h::t),([]) -> aux t laux laux
      | (h1::t1), (h2::t2) -> (h1,h2)::(aux l1 t2 laux)
    in Conjunto (aux l1 l2 l2);;

#+end_src

#+begin_src ocaml
producto_cartesiano c1 c2;;
#+end_src

#+RESULTS:
: Conjunto
:  [(1, 4); (1, 5); (1, 6); (1, 7); (1, 8); (2, 4); (2, 5); (2, 6); (2, 7);
:   (2, 8); (3, 4); (3, 5); (3, 6); (3, 7); (3, 8); (4, 4); (4, 5); (4, 6);
:   (4, 7); (4, 8); (5, 4); (5, 5); (5, 6); (5, 7); (5, 8)]

*** list_of_conjunto
#+begin_src ocaml
val list_of_conjunto : 'a conjunto -> 'a list = <fun>
#+end_src

#+begin_src ocaml :results code :tangle p0_4.ml
  let list_of_conjunto (Conjunto l) = l;;

#+end_src

#+begin_src ocaml
list_of_conjunto c1;;
#+end_src

#+RESULTS:
| 1 | 2 | 3 | 4 | 5 |
